<?php
/**
 * Copyright (c) Since 2024 InnoShop - All Rights Reserved
 *
 * @link       https://www.innoshop.com
 * @author     InnoShop <team@innoshop.com>
 * @license    https://opensource.org/licenses/OSL-3.0 Open Software License (OSL 3.0)
 */

return [
    'btn_buy_now'             => 'Купить сейчас',
    'customer_name'           => 'Уважаемый/ая :name, Здравствуйте!',
    'order_success'           => 'Заказ успешно отправлен',
    'order_success_info'      => 'Ваш заказ был успешно отправлен, вот его детали',
    'order_update'            => 'Статус заказа обновлен',
    'order_update_status'     => 'Статус вашего заказа :number был обновлен до',
    'register_end'            => 'Регистрация завершена, пожалуйста, нажмите кнопку ниже, чтобы вернуться в магазин.',
    'retrieve_password_btn'   => 'Нажмите здесь, чтобы сбросить пароль',
    'retrieve_password_text'  => 'Вы находитесь в процессе восстановления пароля, пожалуйста, нажмите кнопку ниже, чтобы завершить действие.',
    'retrieve_password_title' => 'Сброс пароля',
    'verified_btn'            => 'Нажмите здесь, чтобы завершить проверку электронной почты',
    'verified_failed'         => 'Регистрация прошла успешно! Пожалуйста, перейдите в свою электронную почту и нажмите на ссылку подтверждения, чтобы завершить проверку электронной почты и активировать свою учетную запись.',
    'verified_success'        => 'Подтверждение электронной почты прошло успешно, ваш процесс регистрации завершен, вы можете использовать услуги этой платформы в обычном режиме. Если у вас есть какие-либо вопросы, не стесняйтесь обращаться в службу поддержки в любое время.',
    'verified_success_text'   => 'Пожалуйста, нажмите на ссылку подтверждения, чтобы завершить проверку электронной почты и активировать свою учетную запись.',
    'verified_success_title'  => 'Регистрация успешна',
    'welcome_register'        => 'Добро пожаловать в регистрацию',
];
