<?php
/**
 * Copyright (c) Since 2024 InnoShop - All Rights Reserved
 *
 * @link       https://www.innoshop.com
 * @author     InnoShop <team@innoshop.com>
 * @license    https://opensource.org/licenses/OSL-3.0 Open Software License (OSL 3.0)
 */

return [
    'email_enable'             => 'បើកដំណើរការសេវាកម្មសំបុត្រ',
    'email_engine'             => 'ម៉ាស៊ីនសំបុត្រ',
    'email_notifications'      => 'ការជូនដំណឹងតាមអ៊ីម៉ែល',
    'email_notifications_desc' => 'កំណត់រចនាសម្ព័ន្ធនៅពេលដែលប្រព័ន្ធត្រូវការផ្ញើការជូនដំណឹងតាមអ៊ីម៉ែល',
    'email_setting'            => 'ការកំណត់អ៊ីមែល',
    'email_settings'           => 'ការកំណត់អ៊ីមែល',
    'email_settings_desc'      => 'កំណត់រចនាសម្ព័ន្ធការកំណត់សម្រាប់ការផ្ញើអ៊ីមែល',
    'log_description'          => 'សារនឹងត្រូវបានកត់ត្រានៅក្នុងប្រព័ន្ធហើយនឹងមិនត្រូវបានផ្ញើពិតប្រាកដ',
    'new_order'                => 'ការបង្កើតលំដាប់',
    'order_status_update'      => 'ការផ្លាស់ប្តូរស្ថានភាពបញ្ជាទិញ',
    'password_reset'           => 'សង្គ្រោះពាក្យសម្ងាត់របស់អ្នក។',
    'registration'             => 'ការចុះឈ្មោះអ្នកប្រើប្រាស់ថ្មី',
    'smtp_encryption'          => 'ការអ៊ីនគ្រីប',
    'smtp_host'                => 'ម្ចាស់ផ្ទះសំបុត្រ',
    'smtp_password'            => 'ពាក្យសម្ងាត់អ៊ីមែល',
    'smtp_port'                => 'ច្រក',
    'smtp_timeout'             => 'ពេលវេលាអស់ពេល (វិនាទី)',
    'smtp_username'            => 'ឈ្មោះអ្នកប្រើប្រាស់អ៊ីមែល',
];
