<?php
/**
 * Copyright (c) Since 2024 InnoShop - All Rights Reserved
 *
 * @link       https://www.innoshop.com
 * @author     InnoShop <team@innoshop.com>
 * @license    https://opensource.org/licenses/OSL-3.0 Open Software License (OSL 3.0)
 */

return [
    'active'       => 'Режим включения',
    'basic_info'   => 'Основная информация.',
    'code'         => 'код',
    'code_help'    => 'Единственный код для единицы веса (kg, g, lb).',
    'create'       => 'Создание единицы веса',
    'description'  => 'Весовые единицы используются для управления весом продукции и распределения.',
    'edit'         => 'Единица веса редакции',
    'error_in_use' => 'Невозможно удалить эту весовой единицу, потому что ее использует какой-то продукт.',
    'info'         => 'Поясни.',
    'info_1'       => 'Поле значений показывает, сколько грамм равно единице.',
    'info_2'       => 'Например, 1 кг = 1000 граммов, поэтому значение килограмма (kg) должно быть 1000.',
    'info_3'       => 'Система использует эти значения для преобразования между различными весами.',
    'list'         => 'Список единиц веса',
    'name'         => 'назван',
    'position'     => 'сортировк',
    'status'       => 'состоян',
    'unit'         => 'Единичный символ',
    'unit_help'    => 'Символы, используемые для отображения (например, kg, g, lb).',
    'value'        => 'Значение (в граммах)',
    'value_help'   => 'Сколько грамм за единицу.',
];
