<?php
/**
 * Copyright (c) Since 2024 InnoShop - All Rights Reserved
 *
 * @link       https://www.innoshop.com
 * @author     InnoShop <team@innoshop.com>
 * @license    https://opensource.org/licenses/OSL-3.0 Open Software License (OSL 3.0)
 */

return [
    'already_subscribed'           => 'អាសយដ្ឋានអ៊ីមែលត្រូវបានជាវ។',
    'dont_show_again'              => 'លែងបង្ហាញទៀតហើយ',
    'email'                        => 'ប្រអប់សំបុត្រ',
    'email_invalid'                => 'សូមបញ្ចូលអាសយដ្ឋានអ៊ីមែលដែលមានសុពលភាព។',
    'email_placeholder'            => 'សូមបញ្ចូលអាសយដ្ឋានអ៊ីមែលរបស់អ្នក។',
    'email_required'               => 'សូមបញ្ចូលអាសយដ្ឋានអ៊ីមែលរបស់អ្នក។',
    'name'                         => 'ឈ្មោះ',
    'name_placeholder'             => 'សូមបញ្ចូលឈ្មោះរបស់អ្នក (ជាជម្រើស)',
    'newsletter'                   => 'ការជាវអ៊ីម៉ែល',
    'newsletter_desc'              => 'ជាវព្រឹត្តិបត្រព័ត៌មានរបស់យើងសម្រាប់ព័ត៌មានចុងក្រោយបំផុត និងការផ្តល់ជូនផ្តាច់មុខ។',
    'subscribe'                    => 'ជាវ',
    'subscribe_failed'             => 'ការជាវបរាជ័យ សូមព្យាយាមម្តងទៀត។',
    'subscribe_newsletter'         => 'ជាវអ៊ីមែល',
    'subscribe_success'            => 'សូមអរគុណសម្រាប់ការជាវអ៊ីមែលរបស់យើង!',
    'subscribe_with_account_email' => 'ការជាវនឹងត្រូវបានធ្វើឡើងដោយប្រើអ៊ីមែលគណនីរបស់អ្នក៖ :email',
    'unsubscribe'                  => 'ឈប់ជាវ',
    'unsubscribe_failed'           => 'ឈប់ជាវបរាជ័យ ព្យាយាមម្តងទៀត។',
    'unsubscribe_success'          => 'អ្នកបានលុបចោលការជាវរបស់អ្នកដោយជោគជ័យ។',
];
