<pre>
Copyright (c) Since 2024 InnoShop.

本系统开源免费可以商用, 开源协议基于开放软件许可证第3.0版（OSL-3.0）https://opensource.org/license/osl-3-0, 使用本系统须知:
1) 必须保留根目录开源协议文件 LICENSE.txt, 且不得更改。
2) 必须保留原有代码中的注释版权信息, 且不得更改。
3) 必须保留系统内置的官方插件市场，不得去除、隐藏或更改。
4) 如果对于以上三点确有更改的需求，必须取得官方的单独授权。

本开放软件许可证（以下简称“许可证”）适用于任何原创作品（以下简称“原始作品”），其所有者（以下简称“许可方”）已在原始作品的版权声明旁放置了以下许可声明：

根据开放软件许可证第3.0版许可
1) 版权许可授予：版权所有者（许可方）授予你一个全球范围内的、免版税的、非独家的、可再许可的权利，持续版权期限，允许你：

a) 复制原始作品，无论是单独的还是作为集合作品的一部分；
b) 翻译、改编、修改原始作品，创造衍生作品；
c) 向公众分发或传播原始作品和衍生作品，但分发或传播的作品必须也遵循这个开放软件许可证；
d) 公开表演原始作品；
e) 公开展示原始作品。

2) 专利许可授予：许可方授予你一个全球范围内的、免版税的、非独家的、可再许可的权利，在专利有效期内，根据许可方拥有或控制的专利权，制造、使用、销售、提供销售、让人制造和进口原始作品和衍生作品。

3) 源代码许可授予："源代码"指修改原始作品的首选形式，以及所有描述如何修改原始作品的文档。许可方同意在分发原始作品的同时提供源代码的机器可读副本。许可方有权通过在一个信息库中放置源代码的机器可读副本来满足此义务，该信息库应合理地允许你以低廉且方便的方式访问，只要许可方继续分发原始作品。

4) 许可授予的排除：未经许可方明确事先许可，不得使用许可方或原始作品的任何贡献者的名字、商标或服务标记来认可或推广从原始作品中派生的产品。除本许可证明确陈述的内容外，本许可证不授予任何许可方的商标、版权、专利、商业秘密或任何其他知识产权的许可。没有授予制造、使用、销售、提供销售、让人制造或进口任何专利权利的许可，除了第2节中定义的许可权利。即使原始作品中包含了许可方的商标，也没有授予这些商标的许可。本许可证中的任何内容都不应被解释为禁止许可方根据与本许可证不同的条款许可其有权许可的任何原始作品。

5) 外部部署："外部部署"指以任何方式使用、分发或传播原始作品或衍生作品，使除了你之外的任何人都可以使用这些作品，无论是将这些作品分发给这些人还是作为通过网络使用的应用提供。作为本许可证授予的明确条件，你必须将你对原始作品或衍生作品的任何外部部署视为第1(c)节下的分发。

6) 署名权：你必须在你所创建的任何衍生作品的源代码中保留原始作品源代码中的所有版权、专利或商标通知，以及任何许可通知和任何被标识为"署名通知"的描述性文本。你必须使你所创建的任何衍生作品的源代码携带一个突出的署名通知，合理地告知接收者你对原始作品进行了修改。

7) 出处保证和保证免责声明：许可方保证对原始作品的版权和本许可证中授予的专利权由许可方拥有或根据本许可证的条款转许可给你，并得到那些版权和专利权的贡献者的许可。除前一句明确陈述的内容外，原始作品是按照"现状"并在本许可证下提供的，没有任何明示或暗示的保证，包括但不限于非侵权、适销性或适用于特定目的的保证。原始作品的质量的全部风险由你承担。这个保证免责声明是本许可证的一个重要部分。除非在本免责声明下，否则本许可证不会授予对原始作品的任何许可。

8) 责任限制：在任何情况下，无论在侵权（包括疏忽）、合同或其他情况下，许可方不对任何人因本许可证或使用原始作品而产生的任何间接、特殊、附带或后果性损害负责，包括但不限于因商誉损失、工作停止、计算机故障或故障或所有其他商业损害或损失而产生的损害。如果适用法律禁止此类责任限制，则此责任限制不适用。

9) 接受和终止：如果你在任何时候明确同意本许可证，那么这种同意表明你对本许可证及其所有条款和条件的明确和不可撤销的接受。如果你分发或传播原始作品或衍生作品的副本，你必须在情况下合理努力以获得接收者对本许可证条款的明确同意。本许可证限制你对第1节中列出的活动的权利，包括你基于原始作品创建衍生作品的权利，不遵守这些条款和条件是受版权法和国际条约禁止的。本许可证无意影响版权例外和限制（包括"合理使用"或"合理交易"）。如果你未能遵守第1(c)节的条件，本许可证将立即终止，你将不再能够行使本许可证授予给你的任何权利。

10) 专利诉讼终止：如果你开始针对许可方或任何许可方提起诉讼，包括交叉索赔或反诉，声称原始作品侵犯了专利，本许可证将自动终止，你将不再能够行使本许可证授予给你的任何权利。如果你提起诉讼声称原始作品与其他软件或硬件的组合侵犯了专利，此终止条款将不适用。

11) 管辖权、地点和适用法律：与本许可证相关的任何诉讼或诉讼只能由许可方居住或主要业务所在的司法管辖区的法院提起，并适用该司法管辖区的法律，排除其法律冲突条款。明确排除适用联合国国际货物销售合同公约。本许可证终止后或超出本许可证范围的原始作品的任何使用，将受到相应司法管辖区的版权或专利法律的要求和处罚。本节将在本许可证终止后继续有效。

12) 律师费：在任何执行本许可证条款或寻求与此相关的损害赔偿的诉讼中，胜诉方有权收回其成本和费用，包括但不限于合理的律师费和与此类诉讼（包括任何上诉）相关的成本。本节将在本许可证终止后继续有效。

13) 其他：如果本许可证的任何条款被认定为不可执行，则该条款应仅在必要的范围内进行修改以使其可执行。

14) "你"在本许可证中的定义："你"在本许可证中，无论是大写还是小写，指行使本许可证下的权利并遵守本许可证所有条款的个人或法人实体。对于法人实体，"你"包括任何控制、被控制或与你共同控制的实体。就本定义而言，"控制"指（i）无论是通过合同还是其他方式，直接或间接地引起该实体的指导或管理的权力，或（ii）拥有该实体50%或更多的流通股，或（iii）该实体的实益拥有。

15) 使用权：你可以在本许可证或法律未限制或条件限制的所有方式中使用原始作品，许可方承诺不干预或负责你使用原始作品。

16) 本许可证的修改：本许可证版权所有 © 2005 Lawrence Rosen。允许在未经修改的情况下复制、分发或传播本许可证。本许可证中没有任何内容允许你修改本许可证作为原始作品或衍生作品的应用。然而，你可以修改本许可证的文本，并复制、分发或传播你的修改版本（"修改后的许可证"），并将其应用于其他原始作品的创作，但须符合以下条件：（i）你不得以任何方式表明你的修改后的许可证是"开放软件许可证"或"OSL"，你不得在你的修改后的许可证名称中使用这些名称；（ii）你必须用"根据许可"或你自己不与本许可证中的通知相似的通知替换上述第一段中指定的通知；以及（iii）你不得声称你的原始作品是开源软件，除非你的修改后的许可证已获得开源计划（OSI）的批准，并且你遵守其许可审查和认证过程。

</pre>