<?php
/**
 * Copyright (c) Since 2024 InnoShop - All Rights Reserved
 *
 * @link       https://www.innoshop.com
 * @author     InnoShop <team@innoshop.com>
 * @license    https://opensource.org/licenses/OSL-3.0 Open Software License (OSL 3.0)
 */

return [
    'active'       => 'เปิดใช้งานสถานะ',
    'basic_info'   => 'ข้อมูลพื้นฐาน',
    'code'         => 'รหัส',
    'code_help'    => 'รหัสเดียวสำหรับหน่วยน้ำหนัก ( เช่น กิโลกรัมกรัม lb )',
    'create'       => 'สร้างหน่วยน้ำหนัก',
    'description'  => 'หน่วยน้ำหนักสำหรับการจัดการน้ำหนักสินค้า และการคำนวณการจัดส่งสินค้า',
    'edit'         => 'แก้ไขหน่วยน้ำหนัก',
    'error_in_use' => 'ไม่สามารถลบหน่วยน้ำหนักนี้ ได้เนื่องจากมีผลิตภัณฑ์ ที่ใช้งานอยู่',
    'info'         => 'รายละเอียด',
    'info_1'       => 'ฟิลด์ค่าจะแสดงจำนวนกรัมของหน่วยในหน่วย.',
    'info_2'       => 'ตัวอย่างเช่น 1 กิโลกรัมเท่ากับ 1,000 กรัมดังนั้น กิโลกรัมของกิโลกรัมจึงต้องเป็น 1,000',
    'info_3'       => 'ระบบใช้ค่าเหล่านี้ ในการแปลงระหว่า งหน่วยน้ำหนักต่างกัน',
    'list'         => 'รายการหน่วยน้ำหนัก',
    'name'         => 'ชื่อ',
    'position'     => 'เรียงลำดับ',
    'status'       => 'สถานะ',
    'unit'         => 'สัญลักษณ์หน่วย',
    'unit_help'    => 'สัญลักษณ์ ที่ใช้แสดงผล ( เช่น กิโลกรัม, g , lb )',
    'value'        => 'ค่า (หน่วยเป็นกรัม)',
    'value_help'   => 'มีกี่กรัมในหนึ่งหน่วย.',
];
