<?php
/**
 * Copyright (c) Since 2024 InnoShop - All Rights Reserved
 *
 * @link       https://www.innoshop.com
 * @author     InnoShop <team@innoshop.com>
 * @license    https://opensource.org/licenses/OSL-3.0 Open Software License (OSL 3.0)
 */

return [
    'news_blog'            => 'บทความบล็อกใหม่',
    'news_blog_text'       => 'สำรวจอนาคต, พัฒนานวัตกรรม เข้าร่วมกับเรา, ประสบการณ์การสร้างเทคโนโลยีล่าสุด. กรุณาติดตามบล็อกและข่าวสารอัปเดตใหม่ของเรา!',
    'feature_product'      => 'สินค้าแนะนำ',
    'feature_product_text' => 'แต่งกายมัน, ทำให้สไตล์เป็นเครื่องหมายของคุณ. เสื้อผ้าแฟชั่นนี้, กล่าวด้วยการออกแบบที่โดดเด่นและเนื้อผ้าที่สบาย, ผสมผสานบุคลิกกับอลังการอย่างสมบูรณ์. ไม่ว่าจะเป็นการเดินทางประจำวันหรือโอกาสพิเศษ, มันเป็นผลิตภัณฑ์แฟชั่นที่จำเป็นในตู้เสื้อผ้าของคุณ. ยื่นยงการเปลี่ยนแปลง, แสดงเสน่ห์ของคุณ.',
    'bestseller'           => 'สินค้าขายดี',
    'new_arrival'          => 'สินค้าใหม่',
];
