<?php
/**
 * Copyright (c) Since 2024 InnoShop - All Rights Reserved
 *
 * @link       https://www.innoshop.com
 * @author     InnoShop <team@innoshop.com>
 * @license    https://opensource.org/licenses/OSL-3.0 Open Software License (OSL 3.0)
 */

return [
    'btn_buy_now'             => 'ซื้อเดี๋ยวนี้',
    'customer_name'           => 'เรียนคุณ :name สวัสดีครับ/ค่ะ!',
    'order_success'           => 'การสั่งซื้อสำเร็จ',
    'order_success_info'      => 'การสั่งซื้อของคุณถูกส่งเรียบร้อยแล้ว นี่คือรายละเอียด',
    'order_update'            => 'สถานะการสั่งซื้อได้รับการอัปเดต',
    'order_update_status'     => 'สถานะการสั่งซื้อของคุณ :number ได้รับการอัปเดตเป็น',
    'register_end'            => 'การลงทะเบียนเสร็จสิ้น กรุณาคลิกปุ่มด้านล่างเพื่อกลับไปที่ร้านค้า',
    'retrieve_password_btn'   => 'คลิกที่นี่เพื่อตั้งค่ารหัสผ่านใหม่',
    'retrieve_password_text'  => 'คุณกำลังอยู่ในขั้นตอนการกู้คืนรหัสผ่าน กรุณาคลิกปุ่มด้านล่างเพื่อทำการดำเนินการให้เสร็จสิ้น',
    'retrieve_password_title' => 'ตั้งค่ารหัสผ่านใหม่',
    'verified_btn'            => 'คลิกที่นี่เพื่อทำการยืนยันอีเมลให้เสร็จสิ้น',
    'verified_failed'         => 'การลงทะเบียนสำเร็จ! กรุณาไปที่อีเมลของคุณและคลิกที่ลิงก์ยืนยันเพื่อทำการยืนยันอีเมลให้เสร็จสิ้นและเปิดใช้งานบัญชีของคุณ',
    'verified_success'        => 'การยืนยันอีเมลสำเร็จ กระบวนการลงทะเบียนของคุณเสร็จสมบูรณ์ คุณสามารถใช้บริการของแพลตฟอร์มนี้ได้ตามปกติ หากคุณมีคำถามใด ๆ โปรดอย่าลังเลที่จะติดต่อฝ่ายบริการลูกค้าได้ตลอดเวลา',
    'verified_success_text'   => 'กรุณาคลิกที่ลิงก์ยืนยันเพื่อทำการยืนยันอีเมลให้เสร็จสิ้นและเปิดใช้งานบัญชีของคุณ',
    'verified_success_title'  => 'การลงทะเบียนสำเร็จ',
    'welcome_register'        => 'ยินดีต้อนรับสู่การลงทะเบียน',
];
